CSI API ETABS v1
cFunction.GetTypeOAPI Method
 Retrieves the function type for the specified function
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetTypeOAPI(
	string Name,
	ref int FuncType,
	ref int AddType
)
Function GetTypeOAPI (
	Name As String,
	ByRef FuncType As Integer,
	ByRef AddType As Integer
) As Integer
Dim instance As cFunction
Dim Name As String
Dim FuncType As Integer
Dim AddType As Integer
Dim returnValue As Integer
returnValue = instance.GetTypeOAPI(Name,
	FuncType, AddType)
int GetTypeOAPI(
	String^ Name,
	int% FuncType,
	int% AddType
)
abstract GetTypeOAPI :
        Name : string *
        FuncType : int byref *
        AddType : int byref -> int
Parameters
Name
Type: System.String
 The name of an existing function
FuncType
Type: System.Int32
 This is one of the following numbers, indicating the type of function
Response Spectrum
Time History
Power spectral density
Steady state
Heat Transfer
AddType
Type: System.Int32
 The is one of the following items, indicating the function subtype
Response Spectrum Functions
0 = From file
1 = User
2 = UBC94
3 = UBC97
4 = BOCA96
5 = NBCC95
6 = ASCE7-02
7 = NEHRP97
8 = EUROCODE8
9 = NZS4203
10 = Chinese2010
11 = Italian3274
12 = IS1893:2002
13 = ASCE7-05
14 = NBCC2005
15 = EUROCODE8-2004
16 = AS1170-2007
17 = NZS1170-2004
18 = ASCE7-10
19 = NBCC2010
20 = Italian NTC2008
21 = TSC-2007
22 = Uniform
23 = SI 413
24 = Argentina INPRES-CIRSOC 103
25 = Chile Norma NCh433+DS61
26 = Chile Norma NCh2369-2003
27 = Colombia NSR-10
28 = Ecuador NEC-11 Capitulo 2
29 = Guatemala AGIES NSE 2-10
30 = Mexico NTC-2004
31 = Peru Norma E.030
32 = Dominican Republic R-001
33 = Venezuela COVENIN 1756-2:2001
34 = Korean KBC 2009
35 = Mexico CFE-93
36 = Peru NTE E.030 2014
37 = Mexico CFE-2008
38 = Ecuador Norma NEC-SE-DS 2015
39 = Costa Rica Seismic Code 2010
40 = NBCC2015
41 = SP 14.13330.2014
42 = TCVN 9386:2012
43 = IS 1893:2016
44 = ASCE7-16
45 = Korean KBC 2016
Time History Functions
0 = From file
1 = User
2 = Sine
3 = Cosine
4 = Ramp
5 = Sawtooth
6 = Triangular
7 = User periodic
8 N/A
9 = Matched to Response Spectrum
Power Spectral Density Functions
0 = From file
1 = User
Steady State Functions
0 = From file
1 = User
Return Value
Type: Int32
 Returns zero if the type is successfully retrieved; otherwise it returns nonzero
Remarks
Examples
Public Sub Example()
   'dimension variables
   Dim SapObject as cOAPI
   Dim SapModel As cSapModel
   Dim ret As Integer
   Dim FuncType As Integer
   Dim AddType As Integer
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'get function type
       ret = SapModel.Func.GetTypeOAPI("UNIFRS", FuncType, AddType)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cFunction Interface
ETABSv1 Namespace